/************************************************
 * AD_value.h
 * Tetsuya Kaku
 * =============================================
 * AD変換ヘッダファイル
 * =============================================
 * ・ver1.00 一版 2016/01/14 Tetsuya Kaku
 * AD変換する
 * =============================================
 * PIC16F877A
 * MPLAB X IDE(v3.10/Win)
 * XC8 (v1.35/Win)
************************************************/
#ifndef PLATI_TEMP_H
#define	PLATI_TEMP_H

static double get_pt(void);        // AD変換した値から温度データに変換する関数
double get_temp(void);      // 温度データ取得関数

#endif	/* PLATI_TEMP_H */

