/************************************************
 * plati_temp.c
 * Tetsuya Kaku
 * =============================================
 * 白金薄膜温度センサデータ取得ソースファイル
 * =============================================
 * ・ver1.00 一版 2016/01/14 Tetsuya Kaku
 * 白金薄膜温度センサデータ取得
 * =============================================
 * PIC16F877A
 * MPLAB X IDE(v3.10/Win)
 * XC8 (v1.35/Win)
************************************************/
#include <xc.h>
#include <pic16f877a.h>
#include <math.h>
#include "pic_clock.h"
#include "AD_value.h"
#include "plati_temp.h"


/*-----------------------------------------------------
 * @breif
 *     AD変換した値から温度データに変換する関数
 * @param
 *     なし
 * @return
 *     白金薄膜温度データ
 * @note
 *     plati_temp.c内で使用する関数なのでstatic関数
 *---------------------------------------------------*/
static double get_pt(void){
    
    double R1, R2, T1, T2;
    double a = 0.0039083;
    double b = -0.0000005775;
   
    //温度算出の計算
    R1 = (get_adcon()/(5.0-get_adcon()))*2400.0;       //5.0Vを2.4kΩで分圧しているため
    T1 = (R1/100.0-1.0)/a;
    R2 = ((T1*b+a)*T1+1.0)*100.0;
    T2 = (R1/100.0-R2/100.0)/a+T1;

    return T2;
}


/*=====================================================
 * @breif
 *     温度データ取得関数
 * @param
 *     なし
 * @return
 *     平均温度データ
 * @note
 *     温度を取得する関数
 *===================================================*/
double get_temp(void){
    
    double T=0.0;
    double t=0.0;
    int i;
    
    //温度データの平均化
    for(i=0; i<=300; i++){
        t += get_pt();
    }
    T = t/300.0;

    return T;
}
